FOXLYF/text-stm32/6-2 定时器外部时钟/System/Timer.c
#include "stm32f10x.h"                  // Device header

extern uint16_t Num;

void Timer_Init(void)
{
RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2 ,ENABLE);
RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);

GPIO_InitTypeDef GPIO_Initstructure;
GPIO_Initstructure.GPIO_Mode = GPIO_Mode_IPU;
GPIO_Initstructure.GPIO_Pin  = GPIO_Pin_0;
GPIO_Initstructure.GPIO_Speed  = GPIO_Speed_50MHz;
GPIO_Init(GPIOA,&GPIO_Initstructure);
	
TIM_ETRClockMode2Config(TIM2,TIM_ExtTRGPSC_OFF,TIM_ExtTRGPolarity_NonInverted,0x00);

TIM_TimeBaseInitTypeDef TIM_TineBasaInitStructure;
TIM_TineBasaInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
TIM_TineBasaInitStructure.TIM_CounterMode  = TIM_CounterMode_Up;
TIM_TineBasaInitStructure.TIM_Period  = 10 - 1 ;
TIM_TineBasaInitStructure.TIM_Prescaler  = 1;
TIM_TineBasaInitStructure.TIM_RepetitionCounter  = 0;
TIM_TimeBaseInit(TIM2 , &TIM_TineBasaInitStructure);

TIM_ClearFlag(TIM2,TIM_FLAG_Update);
TIM_ITConfig(TIM2,TIM_IT_Update,ENABLE);
	
	NVIC_PriorityGroupConfig (NVIC_PriorityGroup_2 );
	NVIC_InitTypeDef NIVC_InitStruture;
	NIVC_InitStruture.NVIC_IRQChannel = TIM2_IRQn;
	NIVC_InitStruture.NVIC_IRQChannelCmd = ENABLE;
	NIVC_InitStruture.NVIC_IRQChannelPreemptionPriority = 2;
	NIVC_InitStruture.NVIC_IRQChannelSubPriority = 1;
	NVIC_Init(&NIVC_InitStruture);
	
	TIM_Cmd(TIM2,ENABLE);
	
}

uint16_t Timer_GetCounter(void)
{	
return TIM_GetCounter(TIM2);
}

void  TIM2_IRQHandler(void)
{
	if(TIM_GetITStatus(TIM2, TIM_IT_Update)==SET)
	{
		Num ++;
		TIM_ClearITPendingBit(TIM2 ,TIM_IT_Update);
	}
}
